[
  {
    "id": "news_aljazeera_001",
    "title": "LIVE: Iran says still open to diplomacy, Israel vows continued attacks",
    "date": "2025-06-21T07:25:00Z",
    "description": "BREAKING: Iran launched an early morning missile attack on central Israel on Saturday, resulting in a fire in Holon and multiple casualties, as the conflict between the two nations enters its second week with no signs of de-escalation. The Iranian assault targeted several Israeli cities while Israeli forces simultaneously conducted strikes on Iran's Isfahan province, home to a key nuclear research centre, marking a dangerous escalation in the ongoing regional crisis.\n\nCASUALTIES AND IMMEDIATE IMPACT: Three people wounded in Friday's Iranian missile attack in Haifa remain hospitalized at Rambam Hospital, with one person reported in serious condition according to hospital spokesperson statements to Israeli media. The attack has caused significant damage to infrastructure, with emergency personnel working around burnt cars and damaged buildings at impact sites in Be'er Sheva and other affected areas.\n\nDIPLOMATIC EFFORTS AMID VIOLENCE: Despite the ongoing attacks, Iran's Foreign Minister Abbas Araghchi maintains that Iran's nuclear programme is peaceful and the country remains open to diplomacy. However, Iranian officials insist that Israel's attacks must stop first before any meaningful negotiations can begin. Iranian government spokesperson Fatemeh Mohajerani emphasized that Iran has 'no intention of pursuing nuclear weapons' and criticized the international community for not acknowledging Israel as the aggressor, comparing the situation to the false pretexts used for the US invasion of Iraq.\n\nNUCLEAR CONCERNS ESCALATE: Israeli Foreign Minister Gideon Saar claimed that the recent attacks have set back Iran's nuclear weapons capabilities by 2-3 years, though Iran has repeatedly denied seeking to build nuclear weapons. In response to Israeli targeting of nuclear facilities, Iran has reportedly moved nuclear material to secure locations to prevent destruction. The International Atomic Energy Agency (IAEA) chief Rafael Grossi expressed particular concern about potential attacks on Iran's Bushehr nuclear power plant during an emergency UN Security Council meeting.\n\nREGIONAL SPILLOVER: The conflict continues to affect neighboring countries, with Israeli forces targeting a Hezbollah military structure in southern Lebanon's Naqoura area, despite a ceasefire agreement reached in November. The Israeli military claimed the site was used to 'promote terrorist plots against Israeli citizens.' Meanwhile, Iranian drones have been detected and shot down in the occupied Golan Heights and northern West Bank, with sirens sounding across multiple Israeli communities.\n\nECONOMIC AND HUMANITARIAN CRISIS: The prolonged conflict is taking a severe economic toll on both nations. In Iran, those who could afford to leave Tehran have fled to neighboring provinces, creating population pressure and leaving low-income residents under increasing economic stress. Israel's economy faces unprecedented disruption as economic activity has been interrupted in ways not seen in previous conflicts. International evacuations have begun, with India starting the evacuation of over 10,700 citizens from Iran, also facilitating evacuations for Nepalese and Sri Lankan nationals.\n\nINTERNATIONAL RESPONSE: At an emergency UN Security Council meeting, Secretary-General António Guterres appealed for an end to the fighting and return to negotiations. In a notable diplomatic gaffe, US Ambassador Dorothy Shea accidentally said Israel had 'spread chaos, terror and suffering' across the Middle East before correcting herself to blame Iran instead. Russia's President Vladimir Putin has repeatedly assured Israel that Iran does not intend to acquire nuclear weapons, while China and Russia continue to condemn Israel's attacks on Iran.\n\nSECURITY CRACKDOWN: Iranian authorities have arrested 22 people in Qom province on charges of being connected to Israeli intelligence services and 'disturbing public opinion.' The arrests come as Iran faces increasing internal pressure amid the conflict. Israeli forces have also claimed to have assassinated senior Iranian military commanders, including Saeed Izadi, commander of the Palestinian Corps in Iran's Quds Force, and Amin Pour Jodkhi, described as the new commander of Iran's Revolutionary Guards drone brigade.\n\nGLOBAL ECONOMIC IMPLICATIONS: While the conflict has not yet severely impacted global markets, economists warn that any spread to the Persian Gulf or Strait of Hormuz could disrupt global oil supplies, as approximately 20% of world oil supply travels through the strategic waterway. Both Iran and Israel have so far avoided targeting major economic infrastructure, but the potential for escalation remains high.\n\nLOOKING AHEAD: As diplomatic representatives arrive in Geneva for talks, Iran warns of 'proportional response' to any escalation while maintaining openness to dialogue. The international community watches nervously as two of the Middle East's most powerful militaries continue their dangerous confrontation, with the specter of wider regional war looming over an already unstable region. The coming days will be crucial in determining whether diplomatic efforts can prevail over military escalation in this critical moment for regional and global security.",
    "category": "World News",
    "imageurl": [
      "https://www.aljazeera.com/wp-content/uploads/2025/06/2025-06-19T071157Z_947202149_RC2J5FAQ7P08_RTRMADP_3_IRAN-NUCLEAR-ISRAEL-1-1750474956.jpg?w=770&resize=770%2C433&quality=80"
    ],
    "link": [
      "https://www.aljazeera.com/news/liveblog/2025/6/21/live-iran-says-still-open-to-diplomacy-israel-vows-continued-attacks"
    ],
    "comments": [],
    "verification_status": true,
    "size": "l",
    "challenge": false,
    "challenge_id": null
  },
  {
    "id": "malaysia_news_001",
    "title": "Malaysia Announces New Economic Recovery Plan for 2025",
    "date": "2025-06-21T10:30:00Z",
    "description": "Malaysian Prime Minister Anwar Ibrahim unveiled a comprehensive economic recovery plan aimed at boosting GDP growth to 5.5% in 2025. The plan includes significant investments in digital infrastructure, green technology initiatives, and support for small and medium enterprises (SMEs). Key highlights include a RM50 billion stimulus package, tax incentives for renewable energy projects, and enhanced digital payment systems across rural areas. The government also announced plans to strengthen ties with ASEAN partners and attract foreign direct investment through streamlined regulatory processes.",
    "category": "Business",
    "imageurl": [
      "https://images.unsplash.com/photo-1524492412937-b28074a5d7da?ixlib=rb-4.0.3&w=800&q=80"
    ],
    "link": [
      "https://www.bernama.com/en/news.php?id=2345678"
    ],
    "comments": [],
    "verification_status": true,
    "size": "l",
    "challenge": false,
    "challenge_id": null
  },
  {
    "id": "bernama_pm_health_001",
    "title": "PM Anwar Gets Clean Bill Of Health In Check-Up – Serdang Hospital Director",
    "date": "2025-06-21T08:00:00Z",
    "description": "Prime Minister Datuk Seri Anwar Ibrahim received a clean bill of health following his annual medical check-up at Serdang Hospital. The hospital director confirmed that the PM is in very good health and the check-up is part of his commitment to staying fit to lead the countrys administration. The routine health screening includes comprehensive tests to ensure the Prime Minister remains physically capable of fulfilling his demanding role in leading Malaysia.",
    "category": "Politics",
    "imageurl": [
      "https://images.unsplash.com/photo-1576091160399-112ba8d25d1f?ixlib=rb-4.0.3&w=800&q=80"
    ],
    "link": [
      "https://www.bernama.com/en/general/news.php?id=2345679"
    ],
    "comments": [],
    "verification_status": true,
    "size": "m",
    "challenge": false,
    "challenge_id": null
  },
  {
    "id": "bernama_cancer_aid_002",
    "title": "PM Extends Aid To Single Mother Battling Cancer In Pahang",
    "date": "2025-06-21T09:30:00Z",
    "description": "Prime Minister Datuk Seri Anwar Ibrahim has extended assistance to Azizah Mahmood, a single mother battling colon cancer in Kampung Tebing Tinggi, Balok, Kuantan. The assistance comes as part of the governments commitment to supporting vulnerable citizens facing health challenges. Azizah, who has been struggling with medical expenses while caring for her family, received financial aid and assurance of continued government support throughout her treatment journey.",
    "category": "General",
    "imageurl": [
      "https://images.unsplash.com/photo-1559757148-5c350d0d3c56?ixlib=rb-4.0.3&w=800&q=80"
    ],
    "link": [
      "https://www.bernama.com/en/general/news.php?id=2345680"
    ],
    "comments": [],
    "verification_status": true,
    "size": "m",
    "challenge": false,
    "challenge_id": null
  },
  {
    "id": "bernama_defence_watch_003",
    "title": "Defence Ministry Keeping Close Watch On Iran-Israel Conflict",
    "date": "2025-06-21T06:00:00Z",
    "description": "Malaysias Defence Ministry is closely monitoring the escalating Iran-Israel conflict and its potential impact on regional security. The ministry has assured that all necessary precautionary measures are being taken to ensure national security remains intact. Defence officials are coordinating with international partners and maintaining readiness protocols as the situation in the Middle East continues to develop, with particular attention to the safety of Malaysian citizens abroad.",
    "category": "World News",
    "imageurl": [
      "https://images.unsplash.com/photo-1586473219010-2ffc57b0d282?ixlib=rb-4.0.3&w=800&q=80"
    ],
    "link": [
      "https://www.bernama.com/en/general/news.php?id=2345681"
    ],
    "comments": [],
    "verification_status": true,
    "size": "m",
    "challenge": false,
    "challenge_id": null
  },
  {
    "id": "bernama_palm_oil_004",
    "title": "Malaysia To Expand Palm Oil Market To Countries That Have Never Been Buyers",
    "date": "2025-06-21T07:00:00Z",
    "description": "Plantation and Commodities Minister Datuk Seri Johari Abdul Ghani announced Malaysias strategy to explore new palm oil markets, particularly targeting countries that have never been buyers before. This initiative aims to diversify Malaysias palm oil export destinations amidst ongoing geopolitical conflicts affecting traditional markets. The expansion strategy includes diplomatic outreach, trade missions, and showcasing sustainable palm oil production practices to attract new international partners and reduce dependency on existing markets.",
    "category": "Business",
    "imageurl": [
      "https://images.unsplash.com/photo-1571019613454-1cb2f99b2d8b?ixlib=rb-4.0.3&w=800&q=80"
    ],
    "link": [
      "https://www.bernama.com/en/bernamabiz/news.php?id=2345682"
    ],
    "comments": [],
    "verification_status": true,
    "size": "l",
    "challenge": false,
    "challenge_id": null
  },
  {
    "id": "bernama_klia_aerotrain_005",
    "title": "KLIA Aerotrain Relaunch Scheduled For 10 AM On July 1 – Loke",
    "date": "2025-06-21T05:30:00Z",
    "description": "Transport Minister Anthony Loke announced that the KLIA Aerotrain operations will officially relaunch at 10 AM on July 1, 2025. The relaunch comes after extensive safety upgrades and maintenance work to ensure the system adheres to the highest safety standards. The Aerotrain service, which connects the main terminal with satellite terminals at Kuala Lumpur International Airport, has undergone comprehensive testing and certification processes to guarantee passenger safety and operational reliability.",
    "category": "General",
    "imageurl": [
      "https://images.unsplash.com/photo-1544620347-c4fd4a3d5957?ixlib=rb-4.0.3&w=800&q=80"
    ],
    "link": [
      "https://www.bernama.com/en/general/news.php?id=2345683"
    ],
    "comments": [
      {
        "id": 1750501634961,
        "user": "You",
        "content": "I think this is bull shit",
        "timestamp": "2025-06-21T10:27:14.961Z"
      }
    ],
    "verification_status": true,
    "size": "m",
    "challenge": false,
    "challenge_id": null
  },
  {
    "id": "bernama_drug_offenders_006",
    "title": "AADK: 559 Drug Offenders In Q1 2025 Hold Degrees, Including PHDs",
    "date": "2025-06-21T04:45:00Z",
    "description": "The National Anti-Drug Agency (AADK) revealed alarming statistics showing that 559 drug offenders arrested in the first quarter of 2025 hold university degrees, including PhD holders. This represents a concerning trend of drug abuse among highly educated individuals in Malaysia. AADK officials emphasize the need for targeted intervention programs that address the unique challenges faced by educated professionals, including workplace stress, social pressures, and the misconception that education provides immunity from addiction.",
    "category": "General",
    "imageurl": [
      "https://images.unsplash.com/photo-1507003211169-0a1dd7228f2d?ixlib=rb-4.0.3&w=800&q=80"
    ],
    "link": [
      "https://www.bernama.com/en/general/news.php?id=2345684"
    ],
    "comments": [],
    "verification_status": true,
    "size": "l",
    "challenge": false,
    "challenge_id": null
  },
  {
    "id": "bernama_ecommerce_laws_007",
    "title": "Review Of E-Commerce Laws To Be Completed By August - Armizan",
    "date": "2025-06-21T04:15:00Z",
    "description": "Deputy Minister of Domestic Trade and Cost of Living Datuk Armizan Mohd Ali announced that the comprehensive review of e-commerce laws in Malaysia will be completed by August 2025. The review aims to strengthen consumer protection in digital marketplaces and address emerging challenges in online commerce. Key areas being examined include digital payment security, cross-border e-commerce regulations, consumer dispute resolution mechanisms, and platform accountability measures to ensure fair trading practices in the digital economy.",
    "category": "Business",
    "imageurl": [
      "https://images.unsplash.com/photo-1556742049-0cfed4f6a45d?ixlib=rb-4.0.3&w=800&q=80"
    ],
    "link": [
      "https://www.bernama.com/en/bernamabiz/news.php?id=2345685"
    ],
    "comments": [],
    "verification_status": true,
    "size": "m",
    "challenge": false,
    "challenge_id": null
  },
  {
    "id": "bernama_penang_workers_008",
    "title": "Penang Cops Round Up 46 Foreign Workers For Rioting At Hostel",
    "date": "2025-06-21T03:50:00Z",
    "description": "Penang police arrested 46 foreign workers following a riot incident at a workers hostel in the state. The incident reportedly stemmed from disputes over living conditions and wage-related issues. Police have launched a comprehensive investigation to determine the root causes of the unrest and ensure such incidents do not recur. Authorities are also working with relevant agencies to address worker welfare concerns and improve communication channels between employers and foreign workers to prevent future conflicts.",
    "category": "General",
    "imageurl": [
      "https://images.unsplash.com/photo-1589829545856-d10d557cf95f?ixlib=rb-4.0.3&w=800&q=80"
    ],
    "link": [
      "https://www.bernama.com/en/crime_courts/news.php?id=2345686"
    ],
    "comments": [],
    "verification_status": true,
    "size": "m",
    "challenge": false,
    "challenge_id": null
  },
  {
    "id": "bernama_gsma_asean_009",
    "title": "Malaysia To Host GSMA M360 ASEAN From 2026 To 2028",
    "date": "2025-06-20T15:00:00Z",
    "description": "Malaysia has been selected to host the prestigious GSMA M360 ASEAN conference from 2026 to 2028, reinforcing the countrys position as a leading digital hub in Southeast Asia. The three-year hosting agreement will bring together mobile industry leaders, technology innovators, and government officials from across the ASEAN region. This major telecommunications event is expected to showcase Malaysias digital infrastructure capabilities and attract significant investments in the mobile and telecommunications sector, further strengthening the countrys digital economy initiatives.",
    "category": "Technology",
    "imageurl": [
      "https://images.unsplash.com/photo-1540575467063-178a50c2df87?ixlib=rb-4.0.3&w=800&q=80"
    ],
    "link": [
      "https://www.bernama.com/en/bernamabiz/news.php?id=2345687"
    ],
    "comments": [],
    "verification_status": true,
    "size": "l",
    "challenge": false,
    "challenge_id": null
  },
  {
    "id": "bernama_indonesia_evacuation_010",
    "title": "Indonesia Evacuates 100 Citizens From Iran And Israel Amid Regional Tensions",
    "date": "2025-06-21T03:00:00Z",
    "description": "Indonesia has successfully evacuated 100 of its citizens from Iran and Israel as regional tensions continue to escalate in the Middle East. The evacuation operation was coordinated by Indonesian diplomatic missions in both countries, ensuring the safety of Indonesian nationals working and residing in the conflict-affected areas. The Indonesian government has established emergency protocols and is maintaining close coordination with international partners to monitor the situation and provide assistance to any remaining citizens who may require evacuation services.",
    "category": "World News",
    "imageurl": [
      "https://images.unsplash.com/photo-1578662996442-48f60103fc96?ixlib=rb-4.0.3&w=800&q=80"
    ],
    "link": [
      "https://www.bernama.com/en/world/news.php?id=2345688"
    ],
    "comments": [],
    "verification_status": true,
    "size": "m",
    "challenge": false,
    "challenge_id": null
  }
]