[
  {
    "id": "news_aljazeera_001",
    "title": "LIVE: Iran says still open to diplomacy, Israel vows continued attacks",
    "date": "2025-06-21T07:25:00Z",
    "description": "BREAKING: Iran launched an early morning missile attack on central Israel on Saturday, resulting in a fire in Holon and multiple casualties, as the conflict between the two nations enters its second week with no signs of de-escalation. The Iranian assault targeted several Israeli cities while Israeli forces simultaneously conducted strikes on Iran's Isfahan province, home to a key nuclear research centre, marking a dangerous escalation in the ongoing regional crisis.\n\nCASUALTIES AND IMMEDIATE IMPACT: Three people wounded in Friday's Iranian missile attack in Haifa remain hospitalized at Rambam Hospital, with one person reported in serious condition according to hospital spokesperson statements to Israeli media. The attack has caused significant damage to infrastructure, with emergency personnel working around burnt cars and damaged buildings at impact sites in Be'er Sheva and other affected areas.\n\nDIPLOMATIC EFFORTS AMID VIOLENCE: Despite the ongoing attacks, Iran's Foreign Minister Abbas Araghchi maintains that Iran's nuclear programme is peaceful and the country remains open to diplomacy. However, Iranian officials insist that Israel's attacks must stop first before any meaningful negotiations can begin. Iranian government spokesperson Fatemeh Mohajerani emphasized that Iran has 'no intention of pursuing nuclear weapons' and criticized the international community for not acknowledging Israel as the aggressor, comparing the situation to the false pretexts used for the US invasion of Iraq.\n\nNUCLEAR CONCERNS ESCALATE: Israeli Foreign Minister Gideon Saar claimed that the recent attacks have set back Iran's nuclear weapons capabilities by 2-3 years, though Iran has repeatedly denied seeking to build nuclear weapons. In response to Israeli targeting of nuclear facilities, Iran has reportedly moved nuclear material to secure locations to prevent destruction. The International Atomic Energy Agency (IAEA) chief Rafael Grossi expressed particular concern about potential attacks on Iran's Bushehr nuclear power plant during an emergency UN Security Council meeting.\n\nREGIONAL SPILLOVER: The conflict continues to affect neighboring countries, with Israeli forces targeting a Hezbollah military structure in southern Lebanon's Naqoura area, despite a ceasefire agreement reached in November. The Israeli military claimed the site was used to 'promote terrorist plots against Israeli citizens.' Meanwhile, Iranian drones have been detected and shot down in the occupied Golan Heights and northern West Bank, with sirens sounding across multiple Israeli communities.\n\nECONOMIC AND HUMANITARIAN CRISIS: The prolonged conflict is taking a severe economic toll on both nations. In Iran, those who could afford to leave Tehran have fled to neighboring provinces, creating population pressure and leaving low-income residents under increasing economic stress. Israel's economy faces unprecedented disruption as economic activity has been interrupted in ways not seen in previous conflicts. International evacuations have begun, with India starting the evacuation of over 10,700 citizens from Iran, also facilitating evacuations for Nepalese and Sri Lankan nationals.\n\nINTERNATIONAL RESPONSE: At an emergency UN Security Council meeting, Secretary-General António Guterres appealed for an end to the fighting and return to negotiations. In a notable diplomatic gaffe, US Ambassador Dorothy Shea accidentally said Israel had 'spread chaos, terror and suffering' across the Middle East before correcting herself to blame Iran instead. Russia's President Vladimir Putin has repeatedly assured Israel that Iran does not intend to acquire nuclear weapons, while China and Russia continue to condemn Israel's attacks on Iran.\n\nSECURITY CRACKDOWN: Iranian authorities have arrested 22 people in Qom province on charges of being connected to Israeli intelligence services and 'disturbing public opinion.' The arrests come as Iran faces increasing internal pressure amid the conflict. Israeli forces have also claimed to have assassinated senior Iranian military commanders, including Saeed Izadi, commander of the Palestinian Corps in Iran's Quds Force, and Amin Pour Jodkhi, described as the new commander of Iran's Revolutionary Guards drone brigade.\n\nGLOBAL ECONOMIC IMPLICATIONS: While the conflict has not yet severely impacted global markets, economists warn that any spread to the Persian Gulf or Strait of Hormuz could disrupt global oil supplies, as approximately 20% of world oil supply travels through the strategic waterway. Both Iran and Israel have so far avoided targeting major economic infrastructure, but the potential for escalation remains high.\n\nLOOKING AHEAD: As diplomatic representatives arrive in Geneva for talks, Iran warns of 'proportional response' to any escalation while maintaining openness to dialogue. The international community watches nervously as two of the Middle East's most powerful militaries continue their dangerous confrontation, with the specter of wider regional war looming over an already unstable region. The coming days will be crucial in determining whether diplomatic efforts can prevail over military escalation in this critical moment for regional and global security.",
    "category": "World News",
    "imageurl": [
      "https://www.aljazeera.com/wp-content/uploads/2025/06/2025-06-19T071157Z_947202149_RC2J5FAQ7P08_RTRMADP_3_IRAN-NUCLEAR-ISRAEL-1-1750474956.jpg?w=770&resize=770%2C433&quality=80"
    ],
    "link": [
      "https://www.aljazeera.com/news/liveblog/2025/6/21/live-iran-says-still-open-to-diplomacy-israel-vows-continued-attacks"
    ],
    "comments": [
      {
        "id": 1,
        "user": "John Davis",
        "content": "This situation is deeply concerning. The international community needs to step up diplomatic efforts to prevent further escalation.",
        "timestamp": "2025-06-21T08:30:00Z"
      },
      {
        "id": 2,
        "user": "Sarah Ahmed",
        "content": "The humanitarian impact is devastating. Civilians on both sides are suffering while politicians play their dangerous games.",
        "timestamp": "2025-06-21T09:15:00Z"
      },
      {
        "id": 3,
        "user": "Michael Chen",
        "content": "Nuclear facilities should never be targeted. This crosses a red line that could have catastrophic consequences for the entire region.",
        "timestamp": "2025-06-21T10:00:00Z"
      }
    ],
    "verification_status": true,
    "size": "l",
    "challenge": false,
    "challenge_id": null
  },
  {
    "id": "gnews_1o6ufr5no_1750490242398",
    "title": "Israel's aid death traps for starving Gazans",
    "date": "2025-06-21T04:52:30Z",
    "description": "Near-daily Israeli massacres at food distribution sites have killed over 400 Palestinians in the past month alone.",
    "category": "General",
    "imageurl": [
      "https://static.972mag.com/www/uploads/2025/06/001_image00009.jpg"
    ],
    "link": [
      "https://www.972mag.com/hunger-games-israel-gaza-food-aid/"
    ],
    "comments": [
      {
        "id": 1,
        "user": "Emma Thompson",
        "content": "This is heartbreaking. Using food distribution as a trap is a war crime. The international community must act.",
        "timestamp": "2025-06-21T05:30:00Z"
      },
      {
        "id": 2,
        "user": "David Rodriguez",
        "content": "The humanitarian crisis in Gaza is beyond comprehension. How can the world stand by and watch this happen?",
        "timestamp": "2025-06-21T06:45:00Z"
      }
    ],
    "verification_status": false,
    "size": "s",
    "challenge": false,
    "challenge_id": null
  },
  {
    "id": "gnews_xb9hfs3nx_1750490242398",
    "title": "Diablo II: Resurrected Ladder Season 11 Now Live",
    "date": "2025-06-21T03:47:24Z",
    "description": "Ladder Season 11 begins on June 20! Muster the might to liberate Sanctuary's denizens from sinister influences as you race to Level 99.",
    "category": "General",
    "imageurl": [
      "https://bnetcmsus-a.akamaihd.net/cms/blog_header/n4/N4TWKH95498Y1748883506472.png"
    ],
    "link": [
      "https://news.blizzard.com/en-us/article/24208340/diablo-ii-resurrected-ladder-season-11-now-live"
    ],
    "comments": [
      {
        "id": 1,
        "user": "GamerPro123",
        "content": "Finally! Been waiting for the new season. Time to dust off my sorceress and race to 99!",
        "timestamp": "2025-06-21T04:00:00Z"
      },
      {
        "id": 2,
        "user": "RetroGamer",
        "content": "Diablo II never gets old. The ladder reset is always exciting. Good luck to everyone!",
        "timestamp": "2025-06-21T04:30:00Z"
      },
      {
        "id": 3,
        "user": "Necromancer_Master",
        "content": "Any new changes this season or is it the same as Season 10? Either way, I'm in!",
        "timestamp": "2025-06-21T05:15:00Z"
      }
    ],
    "verification_status": false,
    "size": "l",
    "challenge": false,
    "challenge_id": null
  },
  {
    "id": "gnews_qf6y9eoe8_1750490242398",
    "title": "Iran, Israel launch new attacks after Tehran rules out nuclear talks",
    "date": "2025-06-21T03:11:15Z",
    "description": "Iran and Israel exchanged fresh attacks early on Saturday, a day after Tehran said it would not negotiate over its nuclear program while under threat.",
    "category": "General",
    "imageurl": [
      "https://img.ksl.com/slc/3090/309024/30902472.jpeg?filter=kslv2/responsive_story_lg"
    ],
    "link": [
      "https://www.ksl.com/article/51332799/iran-israel-launch-new-attacks-after-tehran-rules-out-nuclear-talks"
    ],
    "comments": [
      {
        "id": 1,
        "user": "Political_Observer",
        "content": "The cycle of retaliation continues. Both sides need to find a way to de-escalate before this spirals out of control.",
        "timestamp": "2025-06-21T03:45:00Z"
      },
      {
        "id": 2,
        "user": "Peace_Advocate",
        "content": "Diplomatic solutions are still possible if both sides show restraint. Violence only breeds more violence.",
        "timestamp": "2025-06-21T04:20:00Z"
      }
      
    ],
    "verification_status": false,
    "size": "s",
    "challenge": false,
    "challenge_id": null
  },
  {
    "id": "gnews_zd75mlj2r_1750490242398",
    "title": "Pirates reliever Dennis Santana suspended 4 games, fined by MLB for taking swing at fan in Detroit",
    "date": "2025-06-21T00:30:00Z",
    "description": "Santana was seen taking a swing at a fan from the visitors' bullpen at Detroit's Comerica Park during the second game of a doubleheader on Thursday.",
    "category": "General",
    "imageurl": [
      "https://s.yimg.com/ny/api/res/1.2/uDcPNn1rYcVCb1O_iXT1Pg--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD04MDE7Y2Y9d2VicA--/https://s.yimg.com/os/creatr-uploaded-images/2025-06/8ef6e950-4e28-11f0-8d9b-b4f80ab9b4e1"
    ],
    "link": [
      "https://sports.yahoo.com/mlb/breaking-news/article/pirates-reliever-dennis-santana-suspended-4-games-fined-by-mlb-for-taking-swing-at-fan-in-detroit-225202581.html"
    ],
    "comments": [
      {
        "id": 1,
        "user": "BaseballFan92",
        "content": "This is completely unacceptable behavior. Players need to maintain professionalism no matter what fans say.",
        "timestamp": "2025-06-21T01:00:00Z"
      },
      {
        "id": 2,
        "user": "SportsAnalyst",
        "content": "4 games seems light for this kind of conduct. The MLB should send a stronger message.",
        "timestamp": "2025-06-21T01:30:00Z"
      },
      {
        "id": 3,
        "user": "Pirates_Fan",
        "content": "Disappointed in Santana. He's better than this and should know fans can get under your skin. Part of the game.",
        "timestamp": "2025-06-21T02:00:00Z"
      }
    ],
    "verification_status": false,
    "size": "s",
    "challenge": false,
    "challenge_id": null
  },
  {
    "id": "gnews_8jwjh8azf_1750490242398",
    "title": "Chef Anne Burrell's death investigated as possible drug overdose, law enforcement officials say",
    "date": "2025-06-21T00:29:32Z",
    "description": "A law enforcement official says Chef Anne Burrell's death is being investigated as a possible drug overdose.",
    "category": "General",
    "imageurl": [
      "https://cdn.abcotvs.com/dip/images/16776076_Anne-Burrell-img.jpg?w=1600"
    ],
    "link": [
      "https://6abc.com/post/chef-anne-burrells-death-investigated-possible-drug-overdose-law-enforcement-officials-say/16802195/"
    ],
    "comments": [
      {
        "id": 1,
        "user": "Culinary_Student",
        "content": "So tragic. Anne Burrell was such an inspiration to many aspiring chefs. RIP to a culinary legend.",
        "timestamp": "2025-06-21T01:15:00Z"
      },
      {
        "id": 2,
        "user": "FoodNetwork_Fan",
        "content": "I loved watching her shows. She brought such energy and passion to cooking. This is heartbreaking news.",
        "timestamp": "2025-06-21T02:30:00Z"
      }
    ],
    "verification_status": false,
    "size": "m",
    "challenge": false,
    "challenge_id": null
  }
]